meeting/agenda/2024/06-18.org
:PROPERTIES:
:ID:       A179CF44-166A-44B7-AB60-6E48BCC9A0F7
:END:
#+title: QT4 CG Meeting 082 Agenda 2024-06-18
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/06-11.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 18 June. The following meeting is scheduled for
25 June.

** Review of open action items [2/18]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [ ] QT4CG-077-04: MK to review inconsistencies discovered in review of #1117
+ [ ] QT4CG-078-01: MK to make the default for normalize-newlines backwards compatible.
+ [ ] QT4CG-079-01: WP to seek expert advice on hashing functions.
+ [ ] QT4CG-080-01: NW to add what the DocBook stylesheets do for this function
+ [X] QT4CG-080-02: NW to fix issue classification so PR #1181 isn’t misclassified as an XSLT issue
+ [ ] QT4CG-080-03: MK to make a separate issue for @as on xsl:value-of
+ [ ] QT4CG-080-04: NW to revise p:invisible-xml
+ [ ] QT4CG-080-05: NW to add absolute property to the parse-uri output
+ [ ] QT4CG-080-06: NW to investigate the cross-spec reference errors in the build
+ [ ] QT4CG-080-07: NW to update the build instructions in the README
+ [ ] QT4CG-080-08: MK to work out what happened to his next-match PR
+ [ ] QT4CG-080-09: MK to address comments made on PR #832
+ [ ] QT4CG-081-01: MK to update fn:round-to-even to point to fn:round
+ [X] QT4CG-081-02: NW to make an issue about how grammar productions should be identified
+ [ ] QT4CG-081-03: MK to make the options parameter optional in ~fn:parse-xml~ and ~fn:parse-xml-fragment~
+ [ ] QT4CG-081-04: NW to update the function signature of fn:invisible-xml
+ [ ] QT4CG-081-04: NW to describe why the grammar option can be empty on fn:invisible-xml

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1231][#1231]]: 1193 Parsing Functions: Empty input
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis - revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-1263][#1263]]: 1224 Add xsl:accumulator-rule/@priority attribute
+ PR [[https://qt4cg.org/dashboard/#pr-1255][#1255]]: 1253 whitespace in xsl:switch

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1280][#1280]]: 1267 fn:apply contradictions
+ PR [[https://qt4cg.org/dashboard/#pr-1279][#1279]]: 1278 - line endings in unparsed-text-lines
+ PR [[https://qt4cg.org/dashboard/#pr-1276][#1276]]: QT4CG-081-03 parse-xml-[fragment]: $options should be optional
+ PR [[https://qt4cg.org/dashboard/#pr-1275][#1275]]: 1274 Further rounding modes
+ PR [[https://qt4cg.org/dashboard/#pr-1270][#1270]]: QT4CG-081-01 Add cross refererence from fn:round-half-to-even
+ PR [[https://qt4cg.org/dashboard/#pr-1268][#1268]]: QT4CG-077-03 Add note on document order across documents
+ PR [[https://qt4cg.org/dashboard/#pr-1266][#1266]]: 1158 Add array mapping operator
+ PR [[https://qt4cg.org/dashboard/#pr-1265][#1265]]: 1161 Further revision of document-uri constraints
+ PR [[https://qt4cg.org/dashboard/#pr-1264][#1264]]: 1245 Correct properties of format-DT function family
+ PR [[https://qt4cg.org/dashboard/#pr-1262][#1262]]: 1160 Add collation-available() function
+ PR [[https://qt4cg.org/dashboard/#pr-1254][#1254]]: 729 Add rules for use of xsi:schemaLocation during validation
+ PR [[https://qt4cg.org/dashboard/#pr-1244][#1244]]: 566-partial Rewrite parse-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1228][#1228]]: – Adding the BLAKE3 hashing algorithm to fn:hash
+ PR [[https://qt4cg.org/dashboard/#pr-1209][#1209]]: 1183 Add transient mode and the transient{} expression
+ PR [[https://qt4cg.org/dashboard/#pr-1185][#1185]]: 1179 array:values, map:values → array:get, map:get

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1225][#1225]]: Generalization of Deep Updates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1069][#1069]]: fn:ucd
+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/755][#755]]: Expression for binding the Context Value
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/657][#657]]: User-defined functions in main modules without `local` prefix
+ Issue [[https://github.com/qt4cg/qtspecs/issues/576][#576]]: JSON serialization: Sequences, INF/NaN, function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/37][#37]]: Support sequence, array, and map destructuring declarations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** HTML 5 template element content
:PROPERTIES:
:CUSTOM_ID: h-BF98CA1E-7B5C-4D07-93C5-73D78AD45BFF
:END:

This is a follow-up from the face-to-face meeting, see [[https://github.com/qt4cg/qtspecs/issues/75][issue 75]].

** PR #1280: 1267 fn:apply contradictions
:PROPERTIES:
:CUSTOM_ID: pr-1280
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1280][#1280]].
** PR #1279: 1278 - line endings in unparsed-text-lines
:PROPERTIES:
:CUSTOM_ID: pr-1279
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1279][#1279]].
** PR #1276: QT4CG-081-03 parse-xml-[fragment]: $options should be optional
:PROPERTIES:
:CUSTOM_ID: pr-1276
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1276][#1276]].
** PR #1275: 1274 Further rounding modes
:PROPERTIES:
:CUSTOM_ID: pr-1275
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1275][#1275]].
** PR #1270: QT4CG-081-01 Add cross refererence from fn:round-half-to-even
:PROPERTIES:
:CUSTOM_ID: pr-1270
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1270][#1270]].
** PR #1268: QT4CG-077-03 Add note on document order across documents
:PROPERTIES:
:CUSTOM_ID: pr-1268
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1268][#1268]].
** PR #1266: 1158 Add array mapping operator
:PROPERTIES:
:CUSTOM_ID: pr-1266
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1266][#1266]].
** PR #1265: 1161 Further revision of document-uri constraints
:PROPERTIES:
:CUSTOM_ID: pr-1265
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1265][#1265]].
** PR #1264: 1245 Correct properties of format-DT function family
:PROPERTIES:
:CUSTOM_ID: pr-1264
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1264][#1264]].
** PR #1262: 1160 Add collation-available() function
:PROPERTIES:
:CUSTOM_ID: pr-1262
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1262][#1262]].
** PR #1254: 729 Add rules for use of xsi:schemaLocation during validation
:PROPERTIES:
:CUSTOM_ID: pr-1254
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1254][#1254]].
** PR #1244: 566-partial Rewrite parse-uri
:PROPERTIES:
:CUSTOM_ID: pr-1244
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1244][#1244]].
** PR #1228: – Adding the BLAKE3 hashing algorithm to fn:hash
:PROPERTIES:
:CUSTOM_ID: pr-1228
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1228][#1228]].
Still waiting for feedback from WP.
** PR #1209: 1183 Add transient mode and the transient{} expression
:PROPERTIES:
:CUSTOM_ID: pr-1209
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1209][#1209]].
** PR #1185: 1179 array:values, map:values → array:get, map:get
:PROPERTIES:
:CUSTOM_ID: pr-1185
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1185][#1185]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
