meeting/agenda/2024/06-18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 082 Agenda 2024-06-18</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 082 Agenda 2024-06-18</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/06-11.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 18 June. The following meeting is scheduled for
25 June.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/18]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-077-04: MK to review inconsistencies discovered in review of #1117</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-078-01: MK to make the default for normalize-newlines backwards compatible.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-079-01: WP to seek expert advice on hashing functions.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-01: NW to add what the DocBook stylesheets do for this function</li>
<li class="on"><code>[X]</code> QT4CG-080-02: NW to fix issue classification so PR #1181 isn’t misclassified as an XSLT issue</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-03: MK to make a separate issue for @as on xsl:value-of</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-04: NW to revise p:invisible-xml</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-05: NW to add absolute property to the parse-uri output</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-06: NW to investigate the cross-spec reference errors in the build</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-07: NW to update the build instructions in the README</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-08: MK to work out what happened to his next-match PR</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-080-09: MK to address comments made on PR #832</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-081-01: MK to update fn:round-to-even to point to fn:round</li>
<li class="on"><code>[X]</code> QT4CG-081-02: NW to make an issue about how grammar productions should be identified</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-081-03: MK to make the options parameter optional in <code>fn:parse-xml</code> and <code>fn:parse-xml-fragment</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-081-04: NW to update the function signature of fn:invisible-xml</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-081-04: NW to describe why the grammar option can be empty on fn:invisible-xml</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1231">#1231</a>: 1193 Parsing Functions: Empty input</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1227">#1227</a>: 150 PR resubmission for fn ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.2.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1263">#1263</a>: 1224 Add xsl:accumulator-rule/@priority attribute</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1255">#1255</a>: 1253 whitespace in xsl:switch</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1280">#1280</a>: 1267 fn:apply contradictions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1279">#1279</a>: 1278 - line endings in unparsed-text-lines</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1276">#1276</a>: QT4CG-081-03 parse-xml-[fragment]: $options should be optional</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1275">#1275</a>: 1274 Further rounding modes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1270">#1270</a>: QT4CG-081-01 Add cross refererence from fn:round-half-to-even</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1268">#1268</a>: QT4CG-077-03 Add note on document order across documents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1266">#1266</a>: 1158 Add array mapping operator</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1265">#1265</a>: 1161 Further revision of document-uri constraints</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1264">#1264</a>: 1245 Correct properties of format-DT function family</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1262">#1262</a>: 1160 Add collation-available() function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1254">#1254</a>: 729 Add rules for use of xsi:schemaLocation during validation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1244">#1244</a>: 566-partial Rewrite parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1228">#1228</a>: – Adding the BLAKE3 hashing algorithm to fn:hash</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1209">#1209</a>: 1183 Add transient mode and the transient{} expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → array:get, map:get</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.4.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1225">#1225</a>: Generalization of Deep Updates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1069">#1069</a>: fn:ucd</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/755">#755</a>: Expression for binding the Context Value</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/657">#657</a>: User-defined functions in main modules without `local` prefix</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/576">#576</a>: JSON serialization: Sequences, INF/NaN, function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/501">#501</a>: Error handling: Rethrow errors; finally block</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/37">#37</a>: Support sequence, array, and map destructuring declarations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-BF98CA1E-7B5C-4D07-93C5-73D78AD45BFF" class="outline-3">
<h3 id="h-BF98CA1E-7B5C-4D07-93C5-73D78AD45BFF"><span class="section-number-3">2.1.</span> HTML 5 template element content</h3>
<div class="outline-text-3" id="text-h-BF98CA1E-7B5C-4D07-93C5-73D78AD45BFF">
<p>
This is a follow-up from the face-to-face meeting, see <a href="https://github.com/qt4cg/qtspecs/issues/75">issue 75</a>.
</p>
</div>
</div>

<div id="outline-container-pr-1280" class="outline-3">
<h3 id="pr-1280"><span class="section-number-3">2.2.</span> PR #1280: 1267 fn:apply contradictions</h3>
<div class="outline-text-3" id="text-pr-1280">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1280">#1280</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1279" class="outline-3">
<h3 id="pr-1279"><span class="section-number-3">2.3.</span> PR #1279: 1278 - line endings in unparsed-text-lines</h3>
<div class="outline-text-3" id="text-pr-1279">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1279">#1279</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1276" class="outline-3">
<h3 id="pr-1276"><span class="section-number-3">2.4.</span> PR #1276: QT4CG-081-03 parse-xml-[fragment]: $options should be optional</h3>
<div class="outline-text-3" id="text-pr-1276">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1276">#1276</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1275" class="outline-3">
<h3 id="pr-1275"><span class="section-number-3">2.5.</span> PR #1275: 1274 Further rounding modes</h3>
<div class="outline-text-3" id="text-pr-1275">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1275">#1275</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1270" class="outline-3">
<h3 id="pr-1270"><span class="section-number-3">2.6.</span> PR #1270: QT4CG-081-01 Add cross refererence from fn:round-half-to-even</h3>
<div class="outline-text-3" id="text-pr-1270">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1270">#1270</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1268" class="outline-3">
<h3 id="pr-1268"><span class="section-number-3">2.7.</span> PR #1268: QT4CG-077-03 Add note on document order across documents</h3>
<div class="outline-text-3" id="text-pr-1268">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1268">#1268</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1266" class="outline-3">
<h3 id="pr-1266"><span class="section-number-3">2.8.</span> PR #1266: 1158 Add array mapping operator</h3>
<div class="outline-text-3" id="text-pr-1266">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1266">#1266</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1265" class="outline-3">
<h3 id="pr-1265"><span class="section-number-3">2.9.</span> PR #1265: 1161 Further revision of document-uri constraints</h3>
<div class="outline-text-3" id="text-pr-1265">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1265">#1265</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1264" class="outline-3">
<h3 id="pr-1264"><span class="section-number-3">2.10.</span> PR #1264: 1245 Correct properties of format-DT function family</h3>
<div class="outline-text-3" id="text-pr-1264">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1264">#1264</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1262" class="outline-3">
<h3 id="pr-1262"><span class="section-number-3">2.11.</span> PR #1262: 1160 Add collation-available() function</h3>
<div class="outline-text-3" id="text-pr-1262">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1262">#1262</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1254" class="outline-3">
<h3 id="pr-1254"><span class="section-number-3">2.12.</span> PR #1254: 729 Add rules for use of xsi:schemaLocation during validation</h3>
<div class="outline-text-3" id="text-pr-1254">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1254">#1254</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1244" class="outline-3">
<h3 id="pr-1244"><span class="section-number-3">2.13.</span> PR #1244: 566-partial Rewrite parse-uri</h3>
<div class="outline-text-3" id="text-pr-1244">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1244">#1244</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1228" class="outline-3">
<h3 id="pr-1228"><span class="section-number-3">2.14.</span> PR #1228: – Adding the BLAKE3 hashing algorithm to fn:hash</h3>
<div class="outline-text-3" id="text-pr-1228">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1228">#1228</a>.
Still waiting for feedback from WP.
</p>
</div>
</div>
<div id="outline-container-pr-1209" class="outline-3">
<h3 id="pr-1209"><span class="section-number-3">2.15.</span> PR #1209: 1183 Add transient mode and the transient{} expression</h3>
<div class="outline-text-3" id="text-pr-1209">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1209">#1209</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1185" class="outline-3">
<h3 id="pr-1185"><span class="section-number-3">2.16.</span> PR #1185: 1179 array:values, map:values → array:get, map:get</h3>
<div class="outline-text-3" id="text-pr-1185">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
